ninety_nine_cats/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
            <option disabled selected>-- Select a Cat --</option>
            <% Cat.all.each do |cat| %>