ninety_nine_cats/app/controllers/cat_rental_requests_controller.rb

    def create
        @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)

        if @cat_rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 3], ["start_date", "2019-08-04"], ["end_date", "2019-08-11"], ["created_at", "2019-08-05 06:18:22.684646"], ["updated_at", "2019-08-05 06:18:22.684646"]]

    def approve
        @cat_rental_request = CatRentalRequest.find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def deny
        @cat_rental_request = CatRentalRequest.find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]