ninety_nine_cats/app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2019-08-05 15:30:06.345132"], ["id", 6]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2017-02-10' OR end_date < '2015-02-10') AND (status = 'PENDING')  [["id", 6], ["cat_id", 5]]
---
  def approve!
    ActiveRecord::Base.transaction do
      self.status = 'APPROVED'
      self.save!

      overlapping_requests.each do |rental_request|

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2019-08-05 15:31:24.979499"], ["id", 1]]
---
  def deny!
    self.status = 'DENIED'
    self.save!